portapack-mayhem/mayhem-firmware/firmware/chibios/os/hal/platforms/STM32F37x/hal_lld.h
/*
    ChibiOS/RT - Copyright (C) 2006-2013 Giovanni Di Sirio

    Licensed under the Apache License, Version 2.0 (the "License");
    you may not use this file except in compliance with the License.
    You may obtain a copy of the License at

        http://www.apache.org/licenses/LICENSE-2.0

    Unless required by applicable law or agreed to in writing, software
    distributed under the License is distributed on an "AS IS" BASIS,
    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
    See the License for the specific language governing permissions and
    limitations under the License.
*/

/**
 * @file    STM32F37x/hal_lld.h
 * @brief   STM32F37x HAL subsystem low level driver header.
 * @pre     This module requires the following macros to be defined in the
 *          @p board.h file:
 *          - STM32_LSECLK.
 *          - STM32_LSEDRV.
 *          - STM32_LSE_BYPASS (optionally).
 *          - STM32_HSECLK.
 *          - STM32_HSE_BYPASS (optionally).
 *          .
 *          One of the following macros must also be defined:
 *          - STM32F37X for Analog & DSP devices.
 *          .
 *
 * @addtogroup HAL
 * @{
 */

#ifndef _HAL_LLD_H_
#define _HAL_LLD_H_

#include "stm32.h"
#include "stm32_registry.h"

/*===========================================================================*/
/* Driver constants.                                                         */
/*===========================================================================*/

/**
 * @brief   Defines the support for realtime counters in the HAL.
 */
#define HAL_IMPLEMENTS_COUNTERS TRUE

/**
 * @name    Platform identification
 * @{
 */
#define PLATFORM_NAME           "STM32F37x Analog & DSP"
/** @} */

/**
 * @name    Absolute Maximum Ratings
 * @{
 */
/**
 * @brief   Maximum system clock frequency.
 */
#define STM32_SYSCLK_MAX        72000000

/**
 * @brief   Maximum HSE clock frequency.
 */
#define STM32_HSECLK_MAX        32000000

/**
 * @brief   Minimum HSE clock frequency.
 */
#define STM32_HSECLK_MIN        1000000

/**
 * @brief   Maximum LSE clock frequency.
 */
#define STM32_LSECLK_MAX        1000000

/**
 * @brief   Minimum LSE clock frequency.
 */
#define STM32_LSECLK_MIN        32768

/**
 * @brief   Maximum PLLs input clock frequency.
 */
#define STM32_PLLIN_MAX         24000000

/**
 * @brief   Minimum PLLs input clock frequency.
 */
#define STM32_PLLIN_MIN         1000000

/**
 * @brief   Maximum PLL output clock frequency.
 */
#define STM32_PLLOUT_MAX        72000000

/**
 * @brief   Maximum PLL output clock frequency.
 */
#define STM32_PLLOUT_MIN        16000000

/**
 * @brief   Maximum APB1 clock frequency.
 */
#define STM32_PCLK1_MAX         36000000

/**
 * @brief   Maximum APB2 clock frequency.
 */
#define STM32_PCLK2_MAX         72000000

/**
 * @brief   Maximum ADC clock frequency.
 */
#define STM32_ADCCLK_MAX        14000000

/**
 * @brief   Minimum ADC clock frequency.
 */
#define STM32_ADCCLK_MIN        6000000

/**
 * @brief   Maximum SDADC clock frequency in fast mode.
 */
#define STM32_SDADCCLK_FAST_MAX 6000000

/**
 * @brief   Maximum SDADC clock frequency in slow mode.
 */
#define STM32_SDADCCLK_SLOW_MAX 1500000

/**
 * @brief   Minimum SDADC clock frequency.
 */
#define STM32_SDADCCLK_MIN      500000
/** @} */

/**
 * @name    Internal clock sources
 * @{
 */
#define STM32_HSICLK            8000000     /**< High speed internal clock. */
#define STM32_LSICLK            40000       /**< Low speed internal clock.  */
/** @} */

/**
 * @name    PWR_CR register bits definitions
 * @{
 */
#define STM32_PLS_MASK          (7U << 5)   /**< PLS bits mask.             */
#define STM32_PLS_LEV0          (0U << 5)   /**< PVD level 0.               */
#define STM32_PLS_LEV1          (1U << 5)   /**< PVD level 1.               */
#define STM32_PLS_LEV2          (2U << 5)   /**< PVD level 2.               */
#define STM32_PLS_LEV3          (3U << 5)   /**< PVD level 3.               */
#define STM32_PLS_LEV4          (4U << 5)   /**< PVD level 4.               */
#define STM32_PLS_LEV5          (5U << 5)   /**< PVD level 5.               */
#define STM32_PLS_LEV6          (6U << 5)   /**< PVD level 6.               */
#define STM32_PLS_LEV7          (7U << 5)   /**< PVD level 7.               */
/** @} */

/**
 * @name    RCC_CFGR register bits definitions
 * @{
 */
#define STM32_SW_HSI            (0U << 0)   /**< SYSCLK source is HSI.      */
#define STM32_SW_HSE            (1U << 0)   /**< SYSCLK source is HSE.      */
#define STM32_SW_PLL            (2U << 0)   /**< SYSCLK source is PLL.      */

#define STM32_HPRE_DIV1         (0U << 4)   /**< SYSCLK divided by 1.       */
#define STM32_HPRE_DIV2         (8u << 4)   /**< SYSCLK divided by 2.       */
#define STM32_HPRE_DIV4         (9U << 4)   /**< SYSCLK divided by 4.       */
#define STM32_HPRE_DIV8         (10U << 4)  /**< SYSCLK divided by 8.       */
#define STM32_HPRE_DIV16        (11U << 4)  /**< SYSCLK divided by 16.      */
#define STM32_HPRE_DIV64        (12U << 4)  /**< SYSCLK divided by 64.      */
#define STM32_HPRE_DIV128       (13U << 4)  /**< SYSCLK divided by 128.     */
#define STM32_HPRE_DIV256       (14U << 4)  /**< SYSCLK divided by 256.     */
#define STM32_HPRE_DIV512       (15U << 4)  /**< SYSCLK divided by 512.     */

#define STM32_PPRE1_DIV1        (0U << 8)   /**< HCLK divided by 1.         */
#define STM32_PPRE1_DIV2        (4U << 8)   /**< HCLK divided by 2.         */
#define STM32_PPRE1_DIV4        (5U << 8)   /**< HCLK divided by 4.         */
#define STM32_PPRE1_DIV8        (6U << 8)   /**< HCLK divided by 8.         */
#define STM32_PPRE1_DIV16       (7U << 8)   /**< HCLK divided by 16.        */

#define STM32_PPRE2_DIV1        (0U << 11)  /**< HCLK divided by 1.         */
#define STM32_PPRE2_DIV2        (4U << 11)  /**< HCLK divided by 2.         */
#define STM32_PPRE2_DIV4        (5U << 11)  /**< HCLK divided by 4.         */
#define STM32_PPRE2_DIV8        (6U << 11)  /**< HCLK divided by 8.         */
#define STM32_PPRE2_DIV16       (7U << 11)  /**< HCLK divided by 16.        */

#define STM32_ADCPRE_DIV2       (0U << 14)  /**< PPRE2 divided by 2.        */
#define STM32_ADCPRE_DIV4       (1U << 14)  /**< PPRE2 divided by 4.        */
#define STM32_ADCPRE_DIV6       (2U << 14)  /**< PPRE2 divided by 6.        */
#define STM32_ADCPRE_DIV8       (3U << 14)  /**< PPRE2 divided by 8.        */

#define STM32_PLLSRC_HSI        (0U << 16)  /**< PLL clock source is HSI/2. */
#define STM32_PLLSRC_HSE        (1U << 16)  /**< PLL clock source is
                                                 HSE/PREDIV.                */

